{"pageProps":{"contents":[{"data":{"title":"CONFIDENTIALITY","image":{"src":"/images/lock.jpg","attribution":"Photo by <a href=\"https://unsplash.com/@xvictoriafeliniak?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Victoria Feliniak</a> on <a href=\"https://unsplash.com/photos/mR4_EGY9zTc?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a>"},"feature":false,"excerpt":" How will it ensure that the shared stories and feelings remain private?","order":0,"date":"","slug":"_data/features/confidentiality"},"content":"<h2>How will it ensure that the shared stories and feelings remain private?</h2>\n<ul>\n<li>Members of the group will leave all identifying characteristics of other members out of the conversation and only share their reactions to the stories shared. The origin and details are all kept private.</li>\n<li>Example: <strong>\"my group was talking about how their partner was being verbally abusive, and it got me thinking...\"</strong></li>\n<li>The professional will provide members with numerous examples of how to maintain such confidentiality.</li>\n</ul>\n<h3><u>But what if confidentiality is violated?</u></h3>\n<ul>\n<li>Participants have sign a paper which outlines the rules for maintaining confidentiality.</li>\n<li>If rules are broken, the participant is removed from the group for a period of time until thoroughly reviewed.</li>\n<li>When such a member is confirmed, he or she is removed from the program.</li>\n<li>if another person whose information was compromised wishes to pursue legal action, we are prepared to do so.</li>\n</ul>"},{"data":{"title":"Current Happenings","image":{"src":"/images/hero.jpg","attribution":"Photo by <a href=\"https://unsplash.com/@youssefnaddam?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">youssef naddam</a> on <a href=\"https://unsplash.com/photos/iJ2IG8ckCpA?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a>"},"feature":true,"excerpt":"Each session begins and ends with check-in and check-outs","order":2,"date":"","slug":"_data/features/current-happenings"},"content":"<ul>\n<li>\n<p>Each session begins and ends with check-in and check-outs.</p>\n</li>\n<li>\n<p>Pre-information for not attending a session with a valid reason is given by clients at least 48 hours before the session.</p>\n</li>\n<li>\n<p>At least four weeks of attendance is compulsory for the clients. The methods and ways of leading the session depend upon the idea of the facilitator.</p>\n</li>\n<li>\n<p>We have 50+ people who have filled out the form for group therapy.</p>\n</li>\n<li>\n<p>Out of them, there are people ranging from 17 years of age to 37 years of age.</p>\n</li>\n<li>\n<p>We have divided the group based on the appropriate age and their problems.</p>\n</li>\n<li>\n<p>We have 6 groups in total for now for group therapy which is conducted by both online and physical mediums based on their preference.</p>\n</li>\n<li>\n<p>In addition to this, we also have started an addiction support group and career related support group,</p>\n</li>\n</ul>"}]},"__N_SSG":true}